---
kind: other
id: Methods.T:Autodesk.Revit.DB.FloorType
source: html/e7cde521-9aca-3b5f-76ac-cfc2e71f3cb4.htm
---
# FloorType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.